Repository: abeek1/61439-3_2024
Catalog: tm/EVS-EN_61439-1_2021/EVS-EN_61439-1_2021_10_Design verification  _10 KONSTRUKTSIOONIOMADUSTE KONTROLL.tmx
Source language: en
Languages: et

source: 10.5.2 Effective earth continuity between the exposed-conductive-parts of the class I assembly and the protective circuit It shall be verified that the different exposed-conductive-parts of the assembly are effectively connected to the terminal for the incoming external protective conductor.
et: 10.5.2 I klassi kooste pingealdiste juhtivate osade ja kaitseahela vahelise tõhusa maaühenduse pidevus Tuleb kontrollida, et kooste eri pingealtid juhtivad osad on kindlalt ühendatud siseneva välise kaitsejuhi klemmiga.

source: Verification shall be made using a resistance-measuring instrument that is capable of driving a current of at least 10 A (AC or DC).
et: Kontroll peab toimuma takistusmõõturi kasutamisega, mis on võimeline tekitama vahelduv- või alalisvoolu väärtusega vähemalt 10 A.

source: The current is passed between each exposed-conductivepart and the terminal for the external protective conductor.
et: Vool tuleb juhtida läbi kõigi pingealdiste juhtivate osade ja välise kaitsejuhi klemmi.

source: The resistance shall not exceed 0,1 .
et: Aktiivtakistus ei tohi olla suurem kui 0,1 Ω.

source: It is recommended to limit the duration of the test where low-current equipment is used; otherwise it can be adversely affected by the test.
et: Seal, kus on kasutatud nõrkvooluseadmeid, soovitatakse katsetuse kestust piirata; vastasel korral võivad need katsetusel sattuda ebasoodsa toime alla.

source: 10.5.3 Short-circuit withstand strength of the protective circuit
et: 10.5.3 Kaitseahela lühisetaluvus

source: 10.5.3.1 General
et: 10.5.3.1 Üldnõuded

source: The rated short-circuit withstand strength shall be verified.
et: Tuleb kontrollida tunnus-lühisetaluvust.

source: Verification may be carried out by a comparison to a reference design(s) (see 10.5.3.3 or 10.5.3.4) or with a test as detailed in 10.5.3.5.
et: Kontroll võib toimuda etalonkonstruktsiooni(de)ga võrdlemise teel (vt jaotis 10.5.3.3 või 10.5.3.4) või katsetusega, nagu see on üksikasjalikult esitatud jaotises 10.5.3.5.

source: The original manufacturer shall determine the reference design(s) that will be used in 10.5.3.3 and 10.5.3.4.
et: Esmatootja peab määrama jaotiste 10.5.3.3 ja 10.5.3.4 puhul kasutatava(d) etalonkonstruktsiooni(d).

source: 10.5.3.2 Protective circuits that are exempted from short-circuit withstand verification Where a separate protective conductor is provided in accordance with 8.4.3.2.3, short-circuit testing is not required if one of the conditions of 10.11.2 is fulfilled.
et: 10.5.3.2 Kaitseahelad, millele pole vaja teha lühisetaluvuse kontrolli Jaotisele 8.4.3.2.3 vastava eraldi kaitsejuhi olemasolul ei ole lühisekatsetus vajalik, kui on täidetud üks jaotises 10.11.2 esitatud tingimustest.

source: 10.5.3.3 Verification by comparison with reference designs – Using a checklist Verification is achieved when the comparison of the assembly to be verified with already tested designs using items 1 to 6 and 8 to 10 of the checklist given in Table 13 shows no deviations.
et: 10.5.3.3 Kontroll etalonkonstruktsioonidega võrdlemise teel – kontrollilehe kasutamine Kontroll on korda läinud, kui kontrollitava kooste võrdlus juba katsetatud konstruktsioonidega, kasutades tabelis 13 esitatud kontrollilehe punkte 1 kuni 6 ja 8 kuni 10, ei näita kõrvalekaldeid.

source: To ensure the same current-carrying capacity for that portion of the fault current that flows through the exposed-conductive-parts, the design, number and arrangement of the parts that provide contact between the protective conductor and the exposed-conductive-parts shall be the same as in the reference design.
et: Et tagada samasugune kestvalt lubatav vool selle osa rikkevoolu puhul, mis kulgeb läbi pingealdiste juhtivate osade, peavad kaitsejuhi ja pingealdiste juhtivate osade vahelist ühendust tagavate osade konstruktsioon, arv ja korraldusviis olema samasugused nagu etalonkonstruktsioonil.

source: 10.5.3.4 Verification by comparison with reference designs – Using calculation Verification by comparison with reference designs based on calculation is to be carried out in accordance with 10.11.4.
et: 10.5.3.4 Kontroll etalonkonstruktsiooniga võrdlemise teel – arvutuse kasutamine Arvutustel põhinev kontroll etalonkonstruktsiooniga võrdlemise teel peab toimuma vastavalt jaotisele 10.11.4.

source: 10.5.3.5 Verification by test Subclause 10.11.5.6 applies.
et: 10.5.3.5 Kontroll katsetuse teel Rakendatakse jaotist 10.11.5.6.

source: 10.6 Incorporation of switching devices and components 10.6.1 General Compliance with the design requirements of 8.5 for the incorporation of switching devices and components shall be confirmed by the original manufacturer’s inspection.
et: 10.6 Lülitusseadiste ja komponentide liidendamine 10.6.1 Üldnõuded Vastavus jaotises 8.5 esitatud konstruktsiooninõuetele lülitusseadiste ja komponentide liidendamisel tuleb tõendada esmatootja ülevaatusega.

source: NOTE If the assembly manufacturer carries out a modification to the original manufacturer’s design, then the assembly manufacturer assumes the responsibility of the original manufacturer for that design change and is responsible for carrying out the original manufacturer’s inspection.
et: MÄRKUS Kui kooste tootja töötab välja esmatootja konstruktsiooni modifikatsiooni, tuleb kooste tootjal eeldada esmatootja vastutust selle konstruktsioonimuudatuse eest ja vastutada esmatootja sooritatava ülevaatuse eest.

source: See 10.1.
et: Vt jaotis 10.1.

source: 10.6.2 Electromagnetic compatibility The performance requirements of J.9.4 for electromagnetic compatibility shall be confirmed by inspection or, where necessary, by testing (see 10.12).
et: 10.6.2 Elektromagnetiline ühilduvus Elektromagnetilise ühilduvuse jaotisele J.9.4 vastavaid toimivusnõudeid tuleb kinnitada ülevaatusega või vajaduse korral katsetusega (vt jaotis J.10.12 ).

source: 10.7 Internal electrical circuits and connections Compliance with the design requirements of 8.6 for internal electrical circuits and connections shall be confirmed by the original manufacturer’s inspection.
et: 10.7 Sisemised elektriahelad ja -ühendused Sisemiste elektriahelate ja -ühenduste vastavust jaotise 8.6 konstruktsiooninõuetele tuleb kinnitada esmatootja ülevaatusega.

source: 10.8 Terminals for external conductors Compliance with the design requirements of 8.8 for terminals for external conductors shall be confirmed by the original manufacturer’s inspection.
et: 10.8 Välisjuhtide klemmid Välisjuhtide klemmide vastavust jaotise 8.8 konstruktsiooninõuetele tuleb kinnitada esmatootja ülevaatusega.

source: 10.9 Dielectric properties 10.9.1 General For this test, all the electrical equipment of the assembly shall be connected, except those items of apparatus which, according to the relevant specifications, are designed for a lower test voltage;
et: 10.9 Dielektrilised omadused 10.9.1 Üldnõuded Kooste kõik elektriseadmed peavad selle katsetuse puhul olema ühendatud, väljaarvatult aparatuuri need ühikud, mis asjakohaste määratluste kohaselt on ette nähtud madalama teimipinge jaoks.

source: current-consuming apparatus (e.g. windings, measuring instruments, voltage surge suppression devices) in which the application of the test voltage would cause the flow of a current, shall be disconnected.
et: Samuti tuleb lahti ühendada voolutarbivad aparaadid (nt mähised, mõõteriistad, liigpingepiirikud), mille puhul teimipinge rakendamine võib esile kutsuda voolu kulgemise.

source: Such apparatus shall be disconnected at one of their terminals unless they are not designed to withstand the full test voltage, in which case all terminals may be disconnected.
et: Seda liiki aparaatidel tuleb lahti ühendada üks nende klemmidest; kui need ei ole ette nähtud taluma täis-teimipinget, tuleb lahti ühendada nende kõik klemmid.

source: For test voltage tolerances and the selection of test equipment, see IEC 61180:2016.
et: Katsetuspinge lubatavad hälbed ja katsetusseadmete valik on esitatud standardis IEC 61180:2016.

source: 10.9.2 Power-frequency withstand voltage 10.9.2.1 Main and auxiliary circuits Main circuits and auxiliary circuits that are connected to the main circuit shall be subjected to the test voltage according to Table 8.
et: 10.9.2 Võrgusageduslik taluvuspinge 10.9.2.1 Pea- ja abiahelad Peaahelaid ja peaahelaga ühendatud abiahelaid tuleb katsetada tabeli 8 järgi valitud teimipingega.

source: Auxiliary circuits, whether AC or DC, that are not connected to the main circuit shall be subjected to the test voltage according to Table 9.
et: Vahelduv- ja alalisvoolu-abiahelaid, mis ei ole peaahelaga ühendatud, tuleb katsetada tabeli 9 järgi valitud teimipingega.

source: This test is not carried out on auxiliary circuits:
et: Seda katsetust ei sooritata abiahelate puhul,

source: – which contain only insulated conductors with the appropriate insulation strength as stated by their manufacturers; and
et: — mis sisaldavad üksnes isoleerjuhte, mille asjakohase isolatsioonitugevuse on sätestanud nende tootjad,

source: – which are protected by short-circuit protective devices with the rating not exceeding 16 A;
et: ja

source: and
et: — mis on kaitstud lühisekaitseaparaatidega, mille tunnusvool ei ole üle 16 A, ja

source: – if an electrical function test has been carried out previously at the rated operational voltage for which the auxiliary circuits are designed.
et: — mille elektriline toimivuskatsetus on varem sooritatud tunnus-talitluspingel, mille jaoks abiahelad on projekteeritud.

source: 10.9.2.2 Test voltage Circuits intended for AC applications shall preferably be tested with an AC test voltage.
et: 10.9.2.2 Teimipinge Ahelaid, mis on ette nähtud vahelduvvoolurakendusteks, tuleb eelistatult katsetada vahelduvteimipingega.

source: Substitution of an AC voltage test by a DC voltage test should only be considered when the specimen does not allow testing with AC, e.g. in the case of filters, capacitors and similar, (see IEC 60664-1:2007, 6.1.3.4.1, fifth paragraph).
et: Vahelduvpinge asendamine alalispingega tuleks arvesse üksnes siis, kui näidis ei võimalda katsetamist vahelduvpingega, nt filtrite, kondensaatorite ja muude taoliste puhul (vt standardi IEC 60664-1:2007 jaotise 6.1.3.4.1 viies lõik).

source: NOTE A test with a DC test voltage of a value equal to the peak value of the AC test voltage will be less stringent than the AC voltage test.
et: MÄRKUS Katsetus alalispingega, mille väärtus võrdub vahelduv-teimipinge tippväärtusega, on vähem range kui vahelduvpingekatsetus.

source: Circuits for DC applications shall be tested with AC or DC test voltages corresponding to the rated insulation voltage Ui.
et: Alalisvoolurakenduste ahelad tuleb katsetada vahelduv- või alalis-teimipingega vastavalt isolatsiooni tunnuspingele Ui.

source: Where an AC test voltage is used, it shall have a substantially sinusoidal waveform and a frequency equal to the rated frequency of the assembly with a tolerance of 25 %.
et: Kui kasutatakse vahelduv-teimipinget, peab see olema sisuliselt siinuselise lainekujuga ja selle sagedus peab võrduma kooste tunnussagedusega, tolerantsiga ±25 %.

source: A DC test voltage shall have negligible ripple.
et: Alalis-teimipinge pulsatsioon peab olema kaduvväike.

source: The high-voltage source used for the test shall be so designed that, when the output terminals are short-circuited after the output voltage has been adjusted to the appropriate test voltage, the output current is sufficient to trip the overcurrent relay and it is greater than 100 mA.
et: Katsetusel kasutatav kõrgepingeallikas peab olema sellise ehitusega, et väljundklemmide lühistamisel pärast väljundpinge seadmist asjakohasele teimipingele oleks väljundvool piisav liigvoolurelee rakendumiseks ja suurem kui 100 mA.

source: The overcurrent relay shall not trip when the output current is less than 100 mA.
et: Liigvoolurelee ei tohi rakenduda, kui väljundvool on alla 100 mA.

source: The value of the test voltage shall be that specified in Table 8 or Table 9 as appropriate with a permitted tolerance of 3 %.
et: Teimipinge väärtus peab olema selline, nagu sätestatud tabelis 8 või 9 olenevalt asjakohasusest, lubatava tolerantsiga ±3 %.

source: 10.9.2.3 Application of the test voltage The test voltage at the moment of application shall not exceed 50 % of the full test value.
et: 10.9.2.3 Teimipinge rakendamine Rakendamise hetkel ei tohi katsetuspinge väärtus olla kõrgem kui 50 % katsetuse täispinge väärtusest.

source: It shall then be increased progressively to this full value and maintained for 600+2 s as follows: a) between all live parts of the main circuit connected together (including the auxiliary circuits connected to the main circuit) and exposed-conductive-parts, with the main contacts of all switching devices in the closed position or bridged by a suitable low resistance link; b) between each live part of different potential of the main circuit and, the other live parts of different potential and exposed-conductive-parts connected together, with the main contacts of all switching devices in the closed position or bridged by a suitable low resistance link; c) between each auxiliary circuit not normally connected to the main circuit and the – main circuit; – other circuits; – exposed-conductive-parts.
et: Pinget tuleb seejärel pidevalt suurendada kuni täisväärtuseni ja hoida seda 60+20 s kestel, rakendades seda järgmiselt: a) peaahela kõigi kokku ühendatud pingestatud osade (sealhulgas peaahelaga ühendatud abiahelate) ning pingealdiste juhtivate osade vahele, kusjuures kõigi lülitusaparaatide peakontaktid on suletud asendis või sillatud piisavalt väikese takistusega ühenduse abil; b) peaahela kõigi eri potentsiaaliga pingestatud osade ja kõigi teiste eri potentsiaaliga pingestatud osade ja kokku ühendatud pingealdiste juhtivate osade vahele, kusjuures kõigi lülitusaparaatide peakontaktid on suletud asendis või sillatud piisavalt väikese takistusega ühenduse abil; c) peaahelaga tavaliselt mitte ühendatud iga abiahela ning — peaahela; — muude ahelate; — pingealdiste juhtivate osade vahele.

source: NOTE Power-frequency withstand voltage tests carried out with the voltage maintained for at least 5 s prior to the publication of this document are considered acceptable and need not be repeated.
et: MÄRKUS Võrgusageduslikud taluvuspingekatsetused, mis on sooritatud pinge hoidmise teel vähemalt 5 s jooksul, arvestatakse enne selle dokumendi avaldamist vastuvõetavaks ja neid ei ole vaja korrata.

source: 10.9.2.4 Acceptance criteria The overcurrent relay shall not operate and there shall be no disruptive discharge (see 3.6.17) during the tests.
et: 10.9.2.4 Vastuvõtukriteeriumid Katsetuste kestel ei tohi liigvoolurelee rakenduda ning katsetustel ei tohi tekkida läbilöögilahendusi (vt termin 3.6.17).

source: 10.9.3 Impulse withstand voltage 10.9.3.1 General Verification shall be made by test or by assessment.
et: 10.9.3 Impulsstaluvuspinge 10.9.3.1 Üldnõuded Kontroll tuleb sooritada katsetuse või hindamise teel.

source: In place of the impulse withstand voltage test of 10.9.3.2, the original manufacturer may perform, at their discretion, an equivalent AC or DC voltage test, in accordance with 10.9.3.3 or 10.9.3.4.
et: Impulsstaluvuspinge teimi asemel jaotise 10.9.3.2 kohaselt võib esmatootja omal äranägemisel sooritada samaväärse vahelduv- või alalispingeteimi vastavalt jaotisele 10.9.3.3 või 10.9.3.4.

source: 10.9.3.2 Impulse withstand voltage test The impulse voltage generator shall be adjusted to the required impulse voltage with the assembly connected.
et: 10.9.3.2 Impulsstaluvuspinge katsetamine Impulsspingegeneraator tuleb seadistada ühendatud kooste korral nõutavale impulsspingele.

source: The value of the test voltage shall be that specified in 9.1.3.
et: Teimipinge väärtus peab olema selline, nagu see on sätestatud jaotises 9.1.3.

source: The tolerance of the applied peak voltage shall be 3 %.
et: Rakendatud tipp-pinge tolerants peab olema ±3 %.

source: When the manufacturer agrees, the positive tolerance of the test voltage may be exceeded.
et: Kui tootja on nõus, võib katsetuspinge positiivne tolerants olla kõrgem.

source: Auxiliary circuits not connected to main circuits shall be connected to the earth for the tests a) and b) below.
et: Peaahelaga mitte ühendatud abiahelad tuleb katsetustel a ja b maandada.

source: The 1,2/50 μs impulse voltage shall be applied to the assembly five times for each polarity at intervals of 1 s minimum as follows:
et: Impulsspinge 1,2/50 μs tuleb koostele rakendada mõlemal polaarsusel 5 korda vähemalt 1-sekundiliste ajavahemike järel järgmisel viisil:

source: a) between all the live parts of different potential of the main circuit connected together (including the auxiliary circuits connected to the main circuit) and exposed-conductive-parts, with the main contacts of all switching devices in the closed position or bridged by a suitable low-resistance link;
et: a) peaahela kõigi kokku ühendatud eri potentsiaaliga pingestatud osade (sealhulgas peaahelaga ühendatud abiahelate) ja pingealdiste juhtivate osade vahele, kusjuures kõigi lülitusaparaatide peakontaktid on suletud asendis või sillatud piisavalt väikese takistusega ühenduse abil;

source: b) between each live part of different potential of the main circuit and the other live parts of different potential and exposed-conductive-parts connected together, with the main contacts of all switching devices in the closed position or bridged by a suitable lowresistance link;
et: b) peaahela kõigi eri potentsiaaliga pingestatud osade ning kõigi teiste kokku ühendatud eri potentsiaaliga pingestatud osade ja pingealdiste juhtivate osade vahele, kusjuures kõigi lülitusaparaatide peakontaktid on suletud asendis või sillatud piisavalt väikese takistusega ühenduse abil;

source: c) between each auxiliary circuit not normally connected to the main circuit and the
et: c) iga peaahelaga tavaliselt mitte ühendatud abiahela ning

source: – main circuit;
et: — peaahela;

source: – other circuits;
et: — muude ahelate;

source: – exposed-conductive-parts.
et: — pingealdiste juhtivate ahelate vahele.

source: – which are protected by short-circuit protective devices with a rating not exceeding 16 A; and
et: — mis on kaitstud lühisekaitseaparaatidega, mille tunnusvool ei ole üle 16 A, ja

source: – if an electrical function test has been made previously at the rated operational voltage for which the auxiliary circuits are designed.
et: — kui varem on sooritatud elektriline toimivuskatsetus tunnus-talitluspingel, mille jaoks abiahelad on projekteeritud.

source: For an acceptable result, there shall be no disruptive discharge during the impulse voltage tests.
et: Vastuvõetavaks tulemuseks peetakse läbilöögilahenduste mittetekkimist impulsspingele katsetamise ajal.

source: Some conductor arrangements retain a considerable charge after an impulse test, and for these cases care should be taken when reversing the polarity.
et: Mõned juhtide korraldusviisid säilitavad pärast impulsskatsetust arvestatava laengu ja sel juhtumil tuleks polaarsuse ümberpööramisel olla hoolikas.

source: To allow the arrangement to discharge, the use of appropriate methods, such as the application of three impulses at about 80 % of the test voltage in the reverse polarity before the test, is recommended.
et: Et võimaldada juhtide laengu lahendumist, soovitatakse kasutada sellekohaseid meetodeid, näiteks kolme vastupidise polaarsusega, katsetuspingest ligikaudu 80 % moodustava impulsi rakendamist enne katsetamist.

source: 10.9.3.3 Alternative power-frequency voltage test The test voltage shall have a substantially sinusoidal waveform at the rated frequency with a tolerance of ± 25 %.
et: 10.9.3.3 Alternatiivne katsetamine võrgusageduslikul pingel Teimipinge peab olema sisuliselt siinuselise lainekujuga ja tunnussagedusega, mille tolerants on ±25 %.

source: The value of the test voltage shall be that specified in 9.1.3 and Table 10 as appropriate with a permitted tolerance of  3 %.
et: Teimipinge väärtus peab olema selline, nagu sätestatud jaotises 9.1.3 ja tabelis 10 olenevalt asjakohasusest, lubatava tolerantsiga ±3 %.

source: The power-frequency voltage shall be applied once, at full value, for three cycles (see IEC 60664-1:2007, 6.1.2.2.2.2).
et: Võrgusageduslik pinge tuleb rakendada täisväärtusena ühel korral, kolme perioodi kestel (vt standardi IEC 60664-1:2007 jaotis 6.1.2.2.2.2).

source: It shall be applied to the assembly in the manner described in 10.9.3.2 a), b) and c) above.
et: See tuleb rakendada koostele viisil, mis on kirjeldatud ülal jaotise 10.9.3.2 punktides a, b ja c.

source: For an acceptable result, the overcurrent relay shall not operate and there shall be no disruptive discharge during the tests.
et: Vastuvõetaval katsetustulemusel ei tohi liigvoolurelee rakenduda ega katsetustel tekkida läbilöögilahendusi.

source: 10.9.3.4 Alternative DC voltage test The test voltage shall have negligible ripple.
et: 10.9.3.4 Alternatiivne katsetamine alalispingel Teimipinge pulsatsioon peab olema kaduvväike.

source: The DC voltage shall be applied three times for each polarity for a duration of 10 ms (see IEC 60664-1:2007, 6.1.2.2.2.3).
et: Alalispinge tuleb rakendada mõlema polaarsuse puhul kolmel korral ja kestusega 10 ms (vt standardi IEC 60664-1:2007 jaotis 6.1.2.2.2.3).

source: It shall be applied to the assembly in the manner described in 10.9.3.2 a) and b) above.
et: Pinge tuleb rakendada koostele viisil, mis on kirjeldatud ülal jaotise 10.9.3.2 punktides a ja b.

source: For an acceptable result the overcurrent relay shall not operate and there shall be no disruptive discharge during the tests.
et: Vastuvõetaval katsetustulemusel ei tohi liigvoolurelee rakenduda ega katsetusel tekkida läbilöögilahendusi.

source: 10.9.3.5 Verification assessment Clearances shall be verified by measurement, or verification of measurements on design drawings, employing the measurement methods stated in Annex F.
et: 10.9.3.5 Kontrollhindamine Õhkvahemikke tuleb kontrollida kas mõõtmisega või mõõtmete kontrollimisega projektjoonistel, rakendades lisas F sätestatud mõõtemeetodeid.

source: The clearances shall be at least 1,5 times the values specified in Table 1.
et: Õhkvahemikud peavad olema tabelis 1 sätestatud väärtustest vähemalt 1,5 korda laiemad.

source: NOTE The 1,5 factor applied to the values in Table 1 is to avoid impulse withstand voltage tests for design verification.
et: MÄRKUS Tabeli 1 väärtuste korrutamist teguriga 1,5 rakendatakse selleks, et konstruktsiooni omadusi kontrollida impulsstaluvuspinge katsetusi läbimata.

source: It is a safety factor that takes into consideration manufacturing tolerances.
et: See on ühtlasi ka valmistamise tolerantse arvestav ohutustegur.

source: It shall be verified by assessment of the device manufacturer’s data that all incorporated devices are suitable for the specified rated impulse withstand voltage (Uimp).
et: Seadmete tootjate esitatud andmete kontrolli teel tuleb kindlaks teha, kas kõik koostes sisalduvad seadised sobivad sätestatud tunnus-impulsstaluvuspingele (Uimp).
